app/controllers/alerts_controller.rb

SELECT `alerts`.* FROM `alerts`
---
  def index
    @alerts = Alert.all

INSERT INTO `alerts` (`title`, `description`, `sid`, `created_at`, `updated_at`) VALUES ('asda', 'asd', 1, '2016-01-13 18:06:24', '2016-01-13 18:06:24')
---
  def create
    @alert = Alert.new(alert_params)

    respond_to do |format|
      if @alert.save

SELECT  "alerts".* FROM "alerts" WHERE "alerts"."id" = ? LIMIT 1  [["id", 0]]
---
    def set_alert
      @alert = Alert.find(params[:id])